## Sql & Sql lite

In [1]:
import sqlite3

In [2]:
## connect to an sql lite database
connection =sqlite3.connect('example.db')
connection

In [3]:
cursor=connection.cursor()

In [26]:
cursor.execute('''
Create Table If Not Exists employees(
    id Integer Primary Key,
    name Text Not Null,
    age Integer,
    department text
    )
''')

## Commit the changes
connection.commit()

In [27]:
cursor.execute('''
    select * from employees
''')

In [30]:
## Insert the data in sqlite table
cursor.execute('''
Insert Into employees(name,age,id)
               values('Krish',32,'Data Scientist')

''')

cursor.execute('''
INSERT INTO employees (name, age, id)
VALUES ('Bob', 25, 'Engineering')
''')

cursor.execute('''
INSERT INTO employees (name, age, id)
VALUES ('Charlie', 35, 'Finance')
''')

connection.commit()

In [31]:
cursor.execute('Select * from employees')
rows=cursor.fetchall()

## print the queried data
for row in rows:
    print(row)

('Data Scientist', 'Krish', 32)
('Engineering', 'Bob', 25)
('Finance', 'Charlie', 35)

In [41]:
## update the data of table
cursor.execute('''
       UPDATE employees
              Set age=34 
              where name='Krish'

''')

In [42]:
connection.commit()

In [43]:
cursor.execute('Select * from employees')
rows=cursor.fetchall()

## print the queried data
for row in rows:
    print(row)

('Data Scientist', 'Krish', 34)
('Engineering', 'Bob', 25)
('Finance', 'Charlie', 35)

In [44]:
## working with sales data 
connection=sqlite3.connect('sales_data.db')
cursor=connection.cursor()
cursor.execute('''
CREATE TABLE IF NOT EXISTS sales (
              id INTEGER PRIMARY KEY,
               date TEXT not null,
               product TEXT not null,
               sales INTEGER,
               region TEXT 
               
            )
''')

In [52]:
## insert data into the table;
sales_data=[('2024-01-23','Product1',100,'North'),
            ('2024-01-25','Product2',200,'South'),
            ('2024-01-29','Product3',400,'East'),
            ('2024-01-31','Product4',500,'West')
            
            ]

## bulk insertion in sqlite3
cursor.executemany('''
       Insert into sales(date , product,sales,region)
                   values(?,?,?,?)      

''',sales_data)   
connection.commit()

In [54]:
cursor.execute('SELECT * FROM sales')
rows = cursor.fetchall()

# Print the queried data
for row in rows:
    print(row)

(1, '2024-01-23', 'Product1', 100, 'North')
(2, '2024-01-25', 'Product2', 200, 'South')
(3, '2024-01-29', 'Product3', 400, 'East')
(4, '2024-01-31', 'Product4', 500, 'West')
(5, '2024-01-23', 'Product1', 100, 'North')
(6, '2024-01-25', 'Product2', 200, 'South')
(7, '2024-01-29', 'Product3', 400, 'East')
(8, '2024-01-31', 'Product4', 500, 'West')
(9, '2024-01-23', 'Product1', 100, 'North')
(10, '2024-01-25', 'Product2', 200, 'South')
(11, '2024-01-29', 'Product3', 400, 'East')
(12, '2024-01-31', 'Product4', 500, 'West')
(13, '2024-01-23', 'Product1', 100, 'North')
(14, '2024-01-25', 'Product2', 200, 'South')
(15, '2024-01-29', 'Product3', 400, 'East')
(16, '2024-01-31', 'Product4', 500, 'West')

In [55]:
## close the connection
connection.close()